              //  Вывести квадрат числа.


Console.WriteLine("Введите число: ");
int i = Convert.ToInt32(Console.ReadLine());
Console.WriteLine( i * i);







               // int i = Int32.Parse(Console.ReadLine());   разобрать
               